cd cmd
echo off
set temp="%APPDATA%"
:m1
cls
echo                 СПИСОК ЛИСТОВ АТЛАСА ДВ ДЛЯ КОНВЕРТИРОВАНИЯ
echo №  Краткое описание
echo --------------------------------------------------------------------
echo 1  Атлас Приморского края (квадраты K-52, K-53, K-54, L-53, L-54)
echo 2  L-52. Амурзет, Городеково
echo 3  L-53.
echo 4  M-52. Благовещенск, Белогорск, Свободный
echo 5  M-53. Хабаровск, Комсомольск на Амуре, Биробиджан
echo 6  M-54. Советская гавань, Ванино, Де-кастри
echo 7  N-51. Трасса М58, Тында, Ерофей Павлович
echo 8  N-52. Зея
echo 9  N-53. Северное побережье Хабаровского края, Чумикан
echo 10 N-54. Николаевск на Амуре, Лазарев
echo 11 O-51. Нерюнгри, Алдан
echo 12 O-52. Томмот, Чагда
echo 13 O-53. Югоренок
echo 14 O-54. Охотск
echo 15 O-55.
echo 16 P-51. Вилюйск, Олекминск, Якутск
echo 17 P-53. Хандыга
echo 18 P-55.
echo q  Выход
echo --------
Set /p var="Укажите номер квадрата карты (например 8) и нажмите Enter: "

if %var%==1  atlas-pk
if %var%==2  L-52
if %var%==3  L-53
if %var%==4  M-52
if %var%==5  M-53
if %var%==6  M-54
if %var%==7 N-51
if %var%==8 N-52
if %var%==9 N-53
if %var%==10 N-54
if %var%==11 O-51
if %var%==12 O-52
if %var%==13 O-53
if %var%==14 O-54
if %var%==15 O-55
if %var%==16 P-51
if %var%==17 P-53
if %var%==18 P-55
if %var%==q exit

goto m1